---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties
source: html/fca17725-1925-31a4-1a9b-c773c4329e46.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties

Represents the properties of a Bending Detail Custom Field.

## Syntax (C#)
```csharp
public class BendingDetailCustomFieldProperties : ICustomFieldProperties,
	IDisposable
```